# Задача 1. Язык математики
a = 8
b = 10
c = 12
d = 18
print(int((-3 + a**2) * b - 2**3)/(c - 2 * d))
# Задача 2. Финансовый отчёт
# Задача 3. Следующее и предыдущее числа
# Задача 4. Площадь треугольника
# Задача 5. Часы
# Задача 6. Проверяем бухгалтера
# Задача 7. Поездка по кругу
# Задача 8. «Режем» число на части
# Задача 9. В обратном порядке
# Задача 10. Поменять местами: не всё так просто! (необязательная, повышенной сложности)
